[
  {
    "path": "posts/2021-03-20-south-east-asia-armed-conflicts/",
    "title": "South East Asia Armed Conflicts",
    "description": "Armed conflicts consists in the use of armed force between two or more organized armed groups, governmental or non-governmental, by definition from [International Committee of the Red Cross](https://www.icrc.org/en/doc/assets/files/other/opinion-paper-armed-conflict.pdf). In South East Asia context, the Armed Conflicts have been ongoing for a long time. In 1950s, internal conflicts took place in Myanmar. In 1960s, insurgency happened in South Thailand. You can find the full list [here](https://en.wikipedia.org/wiki/List_of_ongoing_armed_conflicts). In this paper, we did visual analytics on the recent Armed Conflicts in South East Asia from 2015 to 2020 and explored some spatial-temporal patterns from it.",
    "author": [
      {
        "name": "Ling Huang",
        "url": "https://www.linghuang.cc"
      }
    ],
    "date": "2021-03-20",
    "categories": [],
    "contents": "\r\n1. Objective\r\nArmed Conflict Location & Event Data Project (ACLED) collected all the raw dataset about the Armed Conflicts globally. Prof. Kam made a spatial-temporal data visualization here.\r\n\r\nAfter checking the raw dataset, I think we can have a better way to visualize the data so the users would be able to interpret the Armed COnflicts situation in South East Asia easily.\r\nIn this paper, firstly I criticized the original data visualization with some suggestions, then it followed up with implementation in Tableau tool. At the end of the paper, a few important insights were derived from my data visualization.\r\n2. Critics and Recommended Improvements\r\nIn 2012, Ben Jones published an article about the key principles of Data Visualization. In short, we should visualize the data clearly and aesthetically. To support that, he created a Cartesian coordinate system as shown below. \r\nAccording to coordinate system, I observed some clarity and aesthetic issues. \r\nClarity Issues\r\nS/N\r\nClarity\r\nRecommendations and Advantages\r\n1\r\nThe Spatial chart used the dot to illustrate 6 different event types. However, it is extremely difficult for the users to count each event type. Therefore, the users cannot interpret how severe each event type is nor compare against each other.\r\nWe should abandon the circle shape and choose another shape to represent the event types. It will allow the users to interpret the data easier.\r\n2\r\nThe line chart tries to show 6 different event types. But the sequence of the event types does not match the sequence in the legend. It is confusing. Besides, we could find the Fatalities data in the raw dataset but we failed to find it anywhere in the line chart.\r\nWe need to re-plot the line chart for the Event Types and also we need to plot the Fatalities data. It will enable the users to better compare the event types and understand the fatalities.\r\n3\r\nThe X-axis title “Event Date” in the line chart is not correct because it shows at the Year level rather than Day level. The Year 2020 data only considers 2020 Jan 1 to 2020 Oct 31, we need to highlight it. The different Event Types have different scale of Y-axis and it causes misconceptions. For instance, Battles’ scale is ‘400~700’ whereas Riots’ scale is ‘5~20’.\r\nWe should remove the X-axis title “Event Date”. Then, we need to highlight that the data for Year 2020 is cut off at Oct-31, 2020. We need to put all the types in one chart and then use different colors to differentiate them and also synchronize the scale for all types.\r\nAesthetic Issues\r\nS/N\r\nAesthetic\r\nRecommendations and Advantages\r\n4\r\nThe explanation of the numbers are displayed as well as the sheet name. The explanation has repeated 6 times and some of the wordings are cut off.\r\nWe should remove the explanation of the numbers and the sheet name. Rather, we can add the meaning or explanation of the numbers into the title.\r\n5\r\nThe year ‘2020’ in the X-axis and legend names are cut off. Perhaps the font size is a bit large.\r\nChange the font size so that the wordings will not be cut off.\r\n6\r\nThe Spatial chart and line chart are displayed side by side horizontally, as a result of which the space looks too crowded.\r\nMaybe we can re-position the line chart from the right side to the bottom. It will make the entire visualization look tidy and neat.\r\nOn top of the Clarity and Aesthetic issues, we can also find out some Interactivity issues.\r\nInteractivity Issues\r\nS/N\r\nInteractivity\r\nRecommendations and Advantages\r\n7\r\nThe dataset consists of multiple years data but the original data visualization missed out the filter ‘Year’. So, the users cannot interactively to filter the data by specific Year or Year-range.\r\nWe should add the Year filter so the users will be able to clearly compare the changes year over year.\r\n8\r\nThe dataset comprises 6 event types but the original data visualization missed out the filter ‘Event Types’. So, the users cannot interactively to filter the data by event types.\r\nWe should add the Event Type filter so the users can deep dive into each event type and analyze the pattern of each event type.\r\n\r\nTo fix the issues above, we proposed a new design. \r\n\r\n3. Sketch my proposed design\r\nAs explained above, we will plot both the Events and Fatalities data. We will choose line charts for them, and they will be positioned below the Map.\r\nThen, we will have three filters: Year, Event Type and COuntry.\r\nThe sketch is shown as below.\r\n\r\n4. Data Preparation\r\nThe quality of the raw dataset looks good enough for us to start the data visualization. So, we do not need to massage it. Below table is the metadata for the raw dataset.\r\nColumn Name\r\nContent\r\nISO\r\nA numeric code for each individual country\r\nEVENT_ID_CNTY\r\nAn individual identifier by number and country acronym (updated annually)\r\nEVENT_ID_NO_CNTY\r\nAn individual numeric identifier (updated annually)\r\nEVENT_DATE\r\nThe day, month and year on which an event took place\r\nYEAR\r\nThe year in which an event took place\r\nTIME_PRECISION\r\nA numeric code indicating the level of certainty of the date coded for the event\r\nEVENT_TYPE\r\nThe type of event\r\nSUB_EVENT_TYPE\r\nThe type of sub-event\r\nACTOR1\r\nThe named actor involved in the event\r\nASSOC_ACTOR_1\r\nThe named actor associated with or identifying ACTOR1\r\nINTER1\r\nA numeric code indicating the type of ACTOR1\r\nACTOR2\r\nThe named actor involved in the event\r\nASSOC_ACTOR_2\r\nThe named actor associated with or identifying ACTOR2\r\nINTER2\r\nA numeric code indicating the type of ACTOR2\r\nINTERACTION\r\nA numeric code indicating the interaction between types of ACTOR1 and ACTOR2\r\nREGION\r\nThe region of the world where the event took place\r\nCOUNTRY\r\nThe country in which the event took place\r\nADMIN1\r\nThe largest sub-national administrative region in which the event took place\r\nADMIN2\r\nThe second largest sub-national administrative region in which the event took place\r\nADMIN3\r\nThe third largest sub-national administrative region in which the event took place\r\nLOCATION\r\nThe location in which the event took place\r\nLATITUDE\r\nThe latitude of the location\r\nLONGITUDE\r\nThe longitude of the location\r\nGEO_PRECISION\r\nA numeric code indicating the level of certainty of the location coded for the event\r\nSOURCE\r\nThe source of the event report\r\nSOURCE SCALE\r\nThe scale (local, regional, national, international) of the source\r\nNOTES\r\nA short description of the event\r\nFATALITIES\r\nThe number of reported fatalities which occurred during the event\r\nHowever, I would like to point out a few things to take note. Our objective is to evaluate the events data and fatalities data at the country level such as Malaysia, Thailand and Indonesia etc. Therefore, many unnecessary columns in the raw dataset will be ignored.\r\nThe ADMIN1, ADMIN2 and ADMIN3 etc. columns are lower level administrative regions. We do not need them in this visualization.\r\nThe Sub-Event Types are sub-level of Event Types. Since there are too many sub Event Types, let us just focus on the Event types.\r\nThe Latitude and Longitude are for the specific region/city rather than the country itself. We cannot use it as our intention is to plot at country level.\r\nThe Event Date column will not be used since we already have the Year column. In this visualization, we are only concerned at Year level.\r\n5. Step by step implementation in Tableau\r\nLoad the Southeast-Asia_2010-2020_Oct31.xlsx file into Tableau. \r\nFor these unwanted columns, right click its drop-down arrow and then and click ‘Hide’ button to hide it. \r\nAfter hide all those unwanted columns, the cleaned data would like as below. \r\n\r\nCreate a worksheet to show the Choropleth map with Fatalities and Events data\r\nCreate the first worksheet: name it Map. Then, drag the ‘Country’ to Rows and the ‘Fatalities’ to Columns. \r\n\r\nThen, click the Show Me on the top right corner and then choose the Worldmap format. The Latitude and Longitude for the Country would be automatically generated. As shown in below. \r\n\r\n\r\nTo change the Sum(Fatalities)’s color. Click the Edit Colors option from the drop-down arrow. \r\n\r\nSet the Data range Start at 0 and End at 13,000. \r\n\r\nGo to the Tables pane. Right click ‘Country’ field and click ‘Add to New Layer’. \r\n\r\nNow we have two layers Marks. On the Country(2) mark, drag the ‘Event Type’ from Table pane to Color option. \r\n\r\nAlso, drag the ‘Event Type’ to the Size option. \r\n\r\nRight click the Event Type size option, select the Count under the Measure as the size. \r\n\r\nSelect the Pie shape from drop-down menu. \r\n\r\nLet’s increase the size a bit. \r\n\r\nTo add the filters, drag the Country, Event Type and Year from Tables pane to Filters pane. \r\n\r\nSince we focus on Year 2015 to 2020, let’s set the range of Year filter from 2015 to 2020 by right clicking the Year filter drop-down arrow and then clicking Edit Filter. \r\n\r\nRight click the Year filter drop-down arrow and then select Show Filter. \r\n\r\nUnder the Year filter card, rigth click the drop-down arrow and then click ‘Edit Title’. \r\n\r\nChange the title to ‘Select the Year for Map’. \r\n\r\nSo, the final Map worksheet looks like as below. \r\nCreate a worksheet to show Events data\r\nCreate a new worksheet and name it ‘Events’. Drag the Event Type to Rows field and the Year to Columns field. \r\n\r\nUnder the Rows field, right click the drop-down arrow of Event Type and then select the Count from Measure menu. \r\n\r\nDrag the Country from Tables pane to the Color option in Marks pane. \r\n\r\nTo add the filters, add Country, Event Type and Year from Tables pane to Filters pane. \r\n\r\nRight click the drop-down arrow of Country filter and select Show Filter. \r\n\r\nRight click the drop-down arrow of Event Type filter and select Show Filter. \r\n\r\nFor the Event Type filter card, select the ‘All Using This Data Source’ from the ‘Apply to Worksheets’ menu. \r\n\r\nFor the Country filter card, select the ‘All Using This Data Source’ from the ‘Apply to Worksheets’ menu. \r\n\r\nRight click the drop-down arrow of CNT(Event Type) card and select ‘Hide Card’. \r\n\r\nRight click the Y-axis and click ‘Edit Axis’. Then, change the Axis Title to ‘Count of Events’. \r\n\r\nRight click the X-axis and click ‘Edit Axis’. Then change the range of the Year: Fixed Start = 2015 and Fixed End = 2020. \r\n\r\nDouble click the worksheet title to Edit Title. Configure the title as below. \r\n\r\nThe final Events worksheet looks as below.  ### Create the worksheet to show Fatalities data\r\nCreate a new worksheet and name it ‘Fatalities’. Drag the Fatalities to Rows field and the Year to Columns field. Tableau automatically use the SUM measure for Fatalities. \r\n\r\nDrag the Country from Tables pane to the Color option in Marks pane. \r\n\r\nRight click the Y-axis and click ‘Edit Axis’. Then, change the Axis Title to ‘Count of Fatalities’. \r\n\r\nRight click the X-axis and click ‘Edit Axis’. Then change the range of the Year: Fixed Start = 2015 and Fixed End = 2020. \r\n\r\nDouble click the worksheet title to Edit Title. Configure the title as below. \r\n\r\nThe final Fatalities worksheet looks as below. \r\nCreate final dashboard\r\nWe just created three worksheets: Map, Events and Fatalities. Now, let’s start to create a dashboard. Name the dashboard to ‘Armed Conflicts’. By using the Horizontal and Vertical objects, we can drag the three worksheets to the dashboard as shown below. Then, customize the dashboard size 1400x900. Tick the ‘Show dashboard title’. \r\n\r\nLet’s spice up the dashboard a little bit. Double click the Map title and edit the title as below. \r\n\r\nDouble click the dashboard title and edit title as below. \r\n\r\nDrag a Text object to the bottom of the dashboard. \r\n\r\nDouble click the Text object and edit the text as below. \r\n\r\n6. Final Data Visualization in Tableau\r\nHere is the final interactive data visualization in Tableau. You can visit my Tableau Public Profile to play around.\r\n\r\n7. Major Observations from my Data Viz\r\nObservation 1\r\nBy comparing the size of the Pie, it is obvious that Philippines has the most events than other countries in the period 2015 to 2020. Following are Myanmar and then Indonesia. However, the majority of the events in Philippines is the Even Type Violence against civilians(Yellow color) whereas in Myanmar it is Battles(Blue color) and in Indonesia it is Protests(Red color).  BTW. Narrow down the Year range to 1 year, and slide the filter from left to right to observe the changes Year over Year. We will find the same pattern!!! \r\nObservation 2\r\nPhilippines has the most fatalities which is 12,905, followed by Myanmar. It makes sense given that Philippines has the highest count of event occurrences and Myanmar has the second highest. \r\nObservation 3\r\nIn general, Violence against civilians causes the more fatalities than other events. As a result of it, the dead cases suddenly increased dramatically from ~250 in year 2015 to ~3500 in year 2016. Then, it dropped gradually to ~1000 cases in 2020. \r\nObservation 4\r\nIn total, Violence against civilians event occurs the most from 2015 to 2020. The occurrence frequency peaked at ~2500 and then decreased more than 50% to ~1000 in 2020. \r\nObservation 5\r\nThe frequency of Protests event stayed flat at ~1000 from 2015 to 2017. In 2017, it started to take off and grew tremendously to over ~2000 in the year 2020. \r\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-03-20-south-east-asia-armed-conflicts/thumbnail.jpg",
    "last_modified": "2021-03-21T23:50:27+08:00",
    "input_file": "south-east-asia-armed-conflicts.utf8.md"
  },
  {
    "path": "posts/2021-02-14-vizcovid19survey/",
    "title": "Are you willing to get Covid-19 vaccination?",
    "description": "This post is meant to visualize the survey results of willingness of getting COVID19 Vaccination in various countries. The data is provided by [Imperial College London YouGov Covid 19 Behaviour Tracker Data Hub](https://github.com/YouGov-Data/covid-19-tracker) hosted at Github.",
    "author": [
      {
        "name": "Ling Huang",
        "url": "https://www.linghuang.cc"
      }
    ],
    "date": "2021-02-14",
    "categories": [],
    "contents": "\r\n1. Objective\r\nA research team from Imperial College London is currently conducting a survey to understand the willingness of the public on Covid-19 vaccination. Based on the collected results, they came up with the chart below to show the public’s opinion. \r\nAfter examine the chart and check the collected data, I would like to propose a new chart to better show the public’s attitude to the Covid-19 vaccination.\r\n2. Critics and Recommended Improvements\r\nIn terms of the clarity and aesthetics, the original charts have a lot of room for improvement. I marked some on the chart as below and summarized them in the below tables. \r\nClarity Issues\r\nS/N\r\nClarity\r\nRecommendations\r\n1\r\nThe survey was conducted by sampling the population in each country. So, uncertainties surely exist in the survey results. But the chart failed to present the confidence interval to indicate the uncertainties. The charts failed to hit the objective (i.e., show what countries favor the vaccine and what countries do not).\r\nWe need to add the Confidence Intervals into the chart.\r\n2\r\nThe ‘stacked bar chart’ on the left is to show the percentages of each answer. It is difficult for the users to interpret the percentages.\r\nReplace the stacked bar chart with Gantt Chart. In addition, display the average score of the responses.\r\n3\r\nThe ‘bar chart’ on the right, in fact, is part of the left chart. It just extracted the ‘1 - Strongly agree’ part and sorted in descending order. It looks a bit redundant.\r\nThe ‘sorting’ could be realized in one chart, in the left chart directly.\r\n4\r\nThe legend ‘Vac 1’ on the far right is not interpretable at all. The original question is ‘If a Covid-19 vaccine were made available to me this week, I would definitely get it’\r\nShow the exact original question(s) in the chart.\r\nAesthetic Issues\r\nS/N\r\nAesthetic\r\nRecommendations\r\n5\r\nCountry name is not capitalized.\r\nCapitalize the country name.\r\n6\r\nThe X-axis in two charts are not standardized. The X-axis on the left has no decimals whereas the X-axis on the right has decimal. They represent the same thing and the decimal does not add any values.\r\nRemove the decimal in the right chart.\r\n7\r\nBad fonts. And there is a spelling error ‘vacinne’ which should be ‘vaccine’.\r\nChoose a better font and fix the spelling error.\r\n\r\nTo fix the issues above, we proposed a new design. \r\n\r\n3. Sketch my proposed design\r\nAs mentioned earlier, I wanted to choose the Gantt chart. In the original dataset, there are too many questions. In our data viz, let’s focus on these questions below.\r\nTitle\r\nQuestion\r\nvac2_1\r\nI am worried about getting COVID19\r\nvac2_2\r\nI am worried about potential side effects of a COVID19 vaccine\r\nvac2_3\r\nI believe government health authorities in my country will provide me with an effective COVID19 vaccine\r\nvac2_6\r\nIf I do not get a COVID19 vaccine when it is available, I will regret it\r\nvac_3\r\nIf a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it\r\nThe responses are rated as below.\r\nRating\r\nMeaning\r\n1\r\nStrongly agree\r\n2\r\nAgree\r\n3\r\nNeutral\r\n4\r\nDisagree\r\n5\r\nStrongly disagree\r\nBesides, some on-demand parameters such as Gender, Age, Household Size, Household Children and Employment Status etc. are added so that the users are able to break down the results based on his/her interests.\r\nNote: The sketch below is created with UX design tool Axure RP 9.  (PS: as a Product Manager, often times I use it to sketch my ideas before I handover to engineers and UI designers.)If you are interested, you can download my sketch file here. \r\nS/N\r\nAdvantages\r\n1\r\nUse the Gantt chart and Confidence Intervals to display the uncertainty of the survey results.\r\n2\r\nBuild the on-demand filters for the users to view the data of their interest in an interactive way.\r\n3\r\nDisplay the exact original questions for the users to interpret the data.\r\n4\r\nBeautify the charts with better fonts and colors.\r\n\r\n4. Data Preparation\r\nThe original datasets are not suitable for us to use directly in Tableau. We need to massage them a bit to fit for our purpose.\r\nFYI. Since we only consider these 14 countries, let’s keep their files only: australia.csv, canada.csv, denmark.csv, finland.csv, france.csv, germany.csv, italy.csv, japan.csv, netherlands.csv, norway.csv, singapore.csv, south-korea.csv, sweden.csv, united-kingdom.csv.\r\nAs shown below, the original datasets contain too much information. We are only concerned with Gender, Age, Household_size, Household_children, Employment_status, vac2_1, vac2_2, vac2_3, vac2_6 and vac_3 etc., so let’s remove the unnecessary columns.\r\nRecordNo\r\nendtime\r\nqweek\r\ngender\r\nregion\r\n…\r\n0\r\n2/4/2020 15:18\r\nweek 1\r\nFemale\r\nRio de Janeiro\r\n…\r\n1\r\n2/4/2020 15:20\r\nweek 1\r\nFemale\r\nSao Paulo\r\n…\r\n2\r\n2/4/2020 15:22\r\nweek 1\r\nFemale\r\nGoias\r\n…\r\n3\r\n2/4/2020 15:23\r\nweek 1\r\nMale\r\nRio de Janeiro\r\n…\r\n4\r\n2/4/2020 15:25\r\nweek 1\r\nFemale\r\nRio de Janeiro\r\n…\r\n5\r\n2/4/2020 15:38\r\nweek 1\r\nMale\r\nMinas Gerais\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\nIn the Denmark, Finland, Norway and Sweden datasets, their employment status is spread to seven columns.\r\nemployment_status_1\r\nemployment_status_2\r\nemployment_status_3\r\nemployment_status_4\r\n…\r\nNo\r\nNo\r\nYes\r\nNo\r\n…\r\nYes\r\nNo\r\nNo\r\nNo\r\n…\r\nNo\r\nNo\r\nNo\r\nYes\r\n…\r\nNo\r\nNo\r\nNo\r\nNo\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\nLet’s replace the value ‘Yes’ with the actual value like ‘Full time employment’, ‘Not working’, ‘Part time employment’ and ‘Full time student’ etc., and merge them into one column ‘employment_status’ like other datasets.\r\nSome entries have multiple responses on this question, (e.g. the survey respondents chose ‘Yes’ for employment_status_1 and employment_status_2 at the same time. To avoid misunderstanding, we removed these entries.\r\nLet’s add one column ‘Country’ in each dataset, and capitalize the column names for gender, age, household_size, household_children and employment_status. The final clean dataset looks like the table below.\r\nCountry\r\nGender\r\nAge\r\nHousehold_size\r\nHousehold_children\r\nEmployment_status\r\nvac2_1\r\nvac2_2\r\nvac2_3\r\nvac2_6\r\nvac_3\r\nAustralia\r\nFemale\r\n66\r\n1\r\n0\r\nRetired\r\n5\r\n3\r\n3\r\n1\r\n1\r\nAustralia\r\nMale\r\n62\r\n1\r\n0\r\nPart time employment\r\n4\r\n4\r\n2\r\n3\r\n2\r\nAustralia\r\nFemale\r\n34\r\n1\r\n0\r\nPart time employment\r\n3\r\n2\r\n1\r\n1\r\n1\r\nAustralia\r\nMale\r\n43\r\n1\r\n0\r\nFull time employment\r\n4\r\n4\r\n3\r\n3\r\n4\r\nAustralia\r\nFemale\r\n38\r\n1\r\n0\r\nPart time employment\r\n5\r\n2\r\n5\r\n5\r\n1\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\n…\r\nSave each country’s dataset as .csv file. Keep them in one folder.\r\nI uploaded the final datasets here for your download.\r\n5. Step by step implementation in Tableau\r\nStep 1\r\nLoad the australia.csv file into Tableau. As you may have seen, all .csv files appear in the ‘Files’ pane on the left side. \r\nStep 2\r\nClick the dropdown arrow of australia.csv data, and click ‘Remove’ button. \r\nStep 3\r\nNow, we need merge all files into one. So, to create a new union datatable:  - 1. click the New Union button in the ‘Files’ pane;  - 2. then select all data files in the ‘Files’ pane;  - 3. then drag them into the New Union pop-up window;  - 4. click ‘OK’ button. \r\n\r\nStep 4\r\nNew union data show up as below. \r\nStep 5\r\nWe need to make some changes on the data.\r\nchange the data type of Household_children to ‘Number(whole)’. \r\nRename the title of columns vac2_1, vac2_2, vac2_3, vac2_6 and vac_3 with the exact survey questions. \r\nHide the last two columns F12 and Table Name \r\nSelect the columns of Survey questions. Right click, then select ‘Pivot’ to transform the data. \r\nNewly pivot data appears like the table below. \r\nRename the title of the columns as bellow.\r\nPivot Field Names -> Survey Question\r\nPivot Field Values -> Rating Score\r\nHousehold_size -> Household Size\r\nHousehold_children -> Household Children\r\nEmployment_status -> Employment Status \r\n\r\nStep 6\r\nAfter update the column titles, now we can start to build the worksheet. Click the worksheet tab.\r\nRename worksheet to ‘COVID19-Survey’.\r\nRight click the ‘Household Children’ and convert it to dimension. \r\nRight click the ‘Household Size’ and convert it to dimension. \r\nNow, the ‘Household Children’ and ‘Household Size’ move up. \r\nStep 7\r\nNow, we need to create parameter(s) and calculated field(s)/\r\nRight click the white space on the bottom left side. Select ‘Create Parameter…’. \r\nName is ‘Confidence Intervals’. And add three values into the list. \r\nGo to ‘Analysis’ menu and click ‘Create Calculated Field….’ . \r\nwe need to create some fields to generate Lower Bar, Upper Bar and Bar Length for 90%, 95% and 99% Confidence Interval (CI) respectively. Formula are shown as below.\r\nLower_Bar 90%  (Z-value for 90% CI is 1.645) \r\nUpper_Bar 90%  \r\nBar_length 90%  \r\nLower_Bar 95%  (Z-value for 95% CI is 1.96) \r\nUpper_Bar 95%  \r\nBar_length 95%  \r\nLower_Bar 99%  (Z-value for 99% CI is 2.576) \r\nUpper_Bar 99%  \r\nBar_length 99% \r\nLower_Bar  \r\nBar_length \r\n\r\nStep 8\r\nAfter create the parameter and calculated fields, let’s start to plot the chart. \r\nDrag the Country to Rows, and the Rating Score and Lower_Bar to Columns. \r\nChange the measure of Rating Score from Sum to Average. \r\nGo to AVG(Rating Score) pane. Change its shape to Circle. \r\nGo to AGG(Lower_Bar) pane. Change its shape to Gantt Bar. \r\nGo to x-axis of Lower_Bar. Right click and select Dual Axis. \r\nRight click the x-axis. Click Synchronize Axis. \r\nDrag the Bar_length and drop on the Size option under AGG(Lower_Bar) pane. \r\nAdjust the size of AGG(Lower_Bar) and try to make it thinner. \r\nClick Color of AVG(Rating Score) and click Edit Color… \r\nPick two contrasting colors for them:Avg. Rating Score and Lower_Bar. \r\nClick the sort icon of x-axis to make it sort by descending order. Then, Right click the x-axis, and select Edit Axis… \r\nChange the General setting as below. Name the x-axis to ‘Rating Score’ \r\nChange the Tick Marks settings as below. \r\nGo to top header Lower_Bar. Right Click and untick Show Header. Let’s hide the top header. \r\nStep 9\r\nNow, we need to show the filters to make the chart as interactive.\r\nAdd the the dimensions into the Filters pane. \r\nAdd the the Age into the Filters pane. \r\nClick the arrow of each filter and tick Show Filter. \r\nFor each filter, select their displayed pattern as below. \r\nStep 10\r\nNow, we need to show the Confidence Intervals parameter.\r\nclick its arrow button, and tick ‘Show Parameter’. \r\nThen, select its displayed pattern.\r\nLet’s hide the Measure Names card.\r\nStep 11\r\nNow, we need to do some adjustments on the format of the chart.\r\nRight click the x-axis and then click the Format….\r\nFormat it as below.\r\nRight click the y-axis and and then click the Format….\r\nFormat it as below.\r\nRight click the header and and then click the Format….\r\nFormat it as below.\r\nEdit the title as below.\r\nFormat the title as below.\r\nAdd the annotation.\r\nFormat the annotation as below.\r\nAdd the annimations.\r\nConfigure the annimations.\r\nStep 12\r\nNow, we need to create the dashboard.\r\nRename the dashboard to Covid-19 Vaccine Survey, tick the option ‘Show dashboard title’ and then add the worksheet COVID19_Survey into the dashboard.\r\nAdjust the layout of the dashboard. Move these filters and the parameter to the top. Re-align them as the screen below display.\r\n\r\n\r\nThe screen above lacks the dashboard title. Let’s edit the dashboard title as shown below.\r\nRight click the title and select the Format Title….\r\nFormat the title as shown below.\r\nVoila! Here is the final dashboard!\r\n\r\n\r\n6. Final Data Visualization in Tableau\r\nHere is the final interactive data visualization in Tableau. You can visit my Tableau Public Profile to play around.\r\n\r\n\r\n7. Major Observations from my Data Viz\r\nDuring the implementation progress, we can find out three major observations.\r\nObservation 1\r\nBy checking the gender discrepancy on the below two questions, we realize that Female are more worried than Male significantly in very country on getting the Covid19 virus and the potential side effects of the vaccine.\r\nQuestion: I am worried about getting COVID19.\r\nQuestion: I am worried about potential side effects of a COVID19 vaccine.\r\n\r\n\r\n\r\n\r\nObservation 2\r\nBy checking the countries on the below two questions, it is easily to observe that by and large Group 1(Asian Countries: Japan, South Korea and Singapore) are more worried than other countries (Group 2 except France) on getting Covid19 and then potential side effects of the vaccine.\r\nQuestion: I am worried about getting COVID19.\r\nQuestion: I am worried about potential side effects of a COVID19 vaccine.\r\n\r\n\r\n\r\n\r\nObservation 3\r\nWhen it comes to the zeal for vaccination, the people in United Kingdom and Denmark had astonishingly much higher rating scores than other countries. They claimed that they will definitely take the vaccination.\r\nQuestion: If I do not get a COVID19 vaccine when it is available, I will regret it\r\nQuestion: If a Covid-19 vaccine becomes available to me a year from now, I definitely intend to get it.\r\n\r\n\r\n\r\n\r\n++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\r\nDistill is a publication format for scientific and technical writing, native to the web.\r\nLearn more about using Distill at https://rstudio.github.io/distill.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-02-14-vizcovid19survey/covid19vaccine.jpg",
    "last_modified": "2021-02-20T11:08:41+08:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-01-24-my-1st-dataviz-makeover-in-2021/",
    "title": " Is Singapore Residents Labor Force getting older?",
    "description": "Populationg aging is a well-known phenomenon for many years in Singapore. But how does it affect the labor force market? \n\nRecently, I gathered the Residents labor force data (from 2009 to 2019) from Singapore Ministry of Manpower website. \n\nHere in this post, I wanted to share some of the insights derived from my data visualization. In my data visualization, I compared the residents Labor Force Participation Rate in 2009 with that in 2019. Besides, I compared the Shares of different Age Groups in the labor market in 2009 and in 2019. The tool I used is Tableau.",
    "author": [
      {
        "name": "Ling Huang",
        "url": {}
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n1. Objective\r\nSingapore Ministry of Manpower released the report Labour Force in Singapore 2019 on 30-Jan-2020. On the page #22, it threw a statement that ‘More older residents in labor force’ and then illustrated it with the chart ‘Residents Labor Force by Age’. I attach the snapshot as below. \r\nAfter check the original data - Table 5, We feel that this illustration is misleading and cannot fully support the statement.\r\nTherefore, I made some changes on the illustration to better support the statement.\r\n2. Critics and Recommended Improvements\r\nFirst of all, the original chart contains a few Clarify issues and Aesthetic issues.\r\nClarity Issues\r\nY-axis does not exist, then it is very tough to gauge the heights. In addition, these two lines do not have the dots/markers which can highlight the value.\r\nThe shares of Age-groups for June 2009 and June 2019 are stacked together with the Age-groups as the X-axis. It looks like a data table, which undermines the usage of the chart. Since the two solid-lines are used to indicate the percentage of the share of Age-groups, it is redundant to show the numbers again at the bottom.\r\nThe ‘Per Cent’ should not displayed as the subtitle of the chart. Instead, it should be displayed as the unit of the Y-axis. The subtitle is on the top left corner whereas the shares of Age-group are at the bottom (i.e., X-axis). So, it makes the users difficult to interpret the chart.\r\nThe two reference lines (Median Age) neither mean the Age-group (e.g., 40-44, 45-49 etc.) nor mean the share of the Age-groups (e.g., 13.3%, 12.2% etc.). They are just purely two numbers (41 and 44). So, they should not refer to the X-axis. It could be displayed as an annotation.\r\nThe title and subtitle are not helpful for users to understand the context.\r\nThe LFPR data is mentioned in the statement, but it is not shown in the chart.\r\nThe statement compares the shares of labor force Aged 25~54 with the one Aged 55 or over. But it is not clearly illustrated in the chart.\r\nAesthetic Issues\r\nColors of June 2009 and June 2019 do not contrast strongly with each other. They use the Dark Blue and Dark Grey.\r\nAll the text in the chart (except the Source and Note) use the same fonts.\r\nGrid line is missing on the chart.\r\nThese two solid-lines (not the reference lines) do not have the dots/markers.\r\n\r\nBased on the issues, we proposed some improvements to handle these issues. \r\n\r\nImprovements for the Clarity Issues and their merits\r\nAdd Y-axis, axis title and unit; -> so it can be easier to gauge the heights.\r\nRemove the stacked data (June 2009 and June 2019) from the bottom X-axis; -> so it can make the chart looks clear and neat.\r\nRemove the ‘Per Cent’ subtitle. Instead, set it as the unit of Y-axis; -> so the end-users can interpret the unit of data.\r\nRemove the two Reference line. Instead, add them as annotation; -> it is to remove misleading reference line.\r\nChange the title and subtitle to meaningful ones which reflect the context and objectives. -> so the end-users can interpret the whole chart easily.\r\nImprovements for the Aethetic Issues and their merits\r\nChange the colors of 2009-June and 2019-June to make them contrast strongly; -> so the comparison would be more obvious.\r\nChange the fonts, use different fonts for axis title, Legend, Title and Annotation etc.; -> then the key messages can be highlighted.\r\nAdd the grid lines for Y-axis; -> so the end-users can interpret the chart easily.\r\n3. Sketch the design\r\nAs the report mentioned the Residents Local Force Participation Rate, we can add it into the chart as well.\r\nThe upper part of the chart is the Participation Rate of Ages in 2009-June versus in 2019-June.\r\nThe lower part of the chart is the Shares of Ages in 2009-June versus in 2019-June.\r\n\r\n4. Data Preparation\r\nSince we wanted to add the Participation Rate in the chart, we need to download the original data and put it together with the Shares of Ages in one data table.Note: LFPR stands for Labor Force Participation Rate.\r\nAges\r\nLFPR 2009-June\r\nLFPR 2019-June\r\nShares 2009-June\r\nShares 2019-June\r\n15~19\r\n11.8\r\n15.1\r\n1.6\r\n1.6\r\n20~24\r\n63.5\r\n61.0\r\n7.4\r\n6.4\r\n25~29\r\n89.3\r\n90.1\r\n11.1\r\n10.3\r\n30~34\r\n88.3\r\n92.3\r\n12.5\r\n10.9\r\n35~39\r\n85.8\r\n89.6\r\n13.5\r\n11.5\r\n40~44\r\n84.4\r\n88.7\r\n13.3\r\n11.6\r\n45~49\r\n82.1\r\n87.9\r\n13.3\r\n12.2\r\n50~54\r\n78.1\r\n82.3\r\n11.7\r\n11.0\r\n55~59\r\n68.4\r\n75.0\r\n8.0\r\n10.2\r\n60~64\r\n50.6\r\n63.9\r\n4.6\r\n7.3\r\n65~79\r\n29.9\r\n46.1\r\n1.8\r\n4.5\r\n70 & Over\r\n10.5\r\n17.6\r\n1.2\r\n2.7\r\n5. Snapshot of my Final Data Visualization in Tableau\r\nYou can go to my Tableau Public to view High Resolution version. \r\n6. Implementation Guide in Tableau (Step by Step)\r\nLoad the excel file into Tableau\r\nDrag the Ages into Columns, Drag the LFPR 2009-June to the Rows, Drag the LFPR 2019-June on the right side of the chart. \r\nChange it to Line and choose ‘All’ Markers in the Color window. \r\nDrag the Shares 2009-June to Rows and Drag Shares 2019-June to the right side of 2nd chart. \r\nRight click any in the Measure Names pane. Edit all the Alias. Then rename them as easily understandable ones.\r\nRight click any in the Measure Names pane. Click Edit Colors. Then select the contrast colors for 2009 and 2019.\r\nChange the Share 2009-June and Share 2019-June to Area. \r\nSynchronize the Axis for both the upper part of the chart (i.e, Participation Rate) and the lower part of the chart(i.e. Shares).\r\nSelect the Axis on the left side and update the Axis titles. Remove the Right sides Axis titles.\r\nRight click anywhere on the chart to add a few Annotations. \r\nRight click the title to edit the title. I rename it as ‘Singapore Residents Labor Force Participation Rate and Shares by Ages’. \r\n7. Major Observations from final Data Visualization\r\nDuring the implementation progress, we can find out three major observations.\r\nFor the Ages 15~24, in terms of Participation Rate and Shares in Total Labor Force, there are no big differences between 2009-June and 2019-June.\r\nIn 2009-June the majority of Labor Force came from ages 25~54 whereas in 2019-June the majority came from ages 25~59. It implies that people tend to stay longer years in their career. Perhaps more and more employers like to keep the older workers in the workplace, but further investigations are required to prove it.\r\nIn general, almost all ages have higher participation rate in 2019-June than in 2009-June.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-24-my-1st-dataviz-makeover-in-2021/SingaporeLabor.jpg",
    "last_modified": "2021-03-20T13:46:22+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Tech Blog",
    "description": "Welcome to my blog, Tech Blog. I hope you enjoy \nreading it!",
    "author": [
      {
        "name": "Ling Huang",
        "url": "https://ling.party"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-24T14:58:16+08:00",
    "input_file": {}
  }
]
