[
  {
    "path": "posts/2021-01-24-my-1st-dataviz-makeover-in-2021/",
    "title": "My 1st DataViz Makeover in 2021",
    "description": "In this post, I would like to present Singapore Residents Labor Force Participation Rate and Shares by Ages in 2009 and in 2019 via the tool Tableau.  \nBesides, I observed some of the important insights gained from the Data Viz.",
    "author": [
      {
        "name": "Ling Huang",
        "url": {}
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n1. Objective\r\nSingapore Ministry of Manpower released the report Labour Force in Singapore 2019 on 30-Jan-2020. On the page #22, it threw a statement that ‘More older residents in labor force’ and then illustrated it with the chart ‘Residents Labor Force by Age’. I attach the snapshot as below. \r\nAfter check the original data - Table 5, We feel that this illustration is misleading and cannot fully support the statement.\r\nTherefore, we made some changes on the illustration to better support the statement.\r\n2. Critics and Recommended Improvements\r\nFirst of all, the original chart contains a few Clarify issues and Aesthetic issues.\r\nClarity Issues\r\nY-axis does not exist, then it is very tough to gauge the heights. In addition, these two lines do not have the dots/markers which can highlight the value.\r\nThe shares of Age-groups for June 2009 and June 2019 are stacked together with the Age-groups as the X-axis. It looks like a data table, which undermines the usage of the chart. Since the two solid-lines are used to indicate the percentage of the share of Age-groups, it is redundant to show the numbers again at the bottom.\r\nThe ‘Per Cent’ should not displayed as the subtitle of the chart. Instead, it should be displayed as the unit of the Y-axis. The subtitle is on the top left corner whereas the shares of Age-group are at the bottom (i.e., X-axis). So, it makes the users difficult to interpret the chart.\r\nThe two reference lines (Median Age) neither mean the Age-group (e.g., 40-44, 45-49 etc.) nor mean the share of the Age-groups (e.g., 13.3%, 12.2% etc.). They are just purely two numbers (41 and 44). So, they should not refer to the X-axis. It could be displayed as an annotation.\r\nThe title and subtitle are not helpful for users to understand the context.\r\nThe LFPR data is mentioned in the statement, but it is not shown in the chart.\r\nThe statement compares the shares of labor force Aged 25~54 with the one Aged 55 or over. But it is not clearly illustrated in the chart.\r\nAesthetic Issues\r\nColors of June 2009 and June 2019 do not contrast strongly with each other. They use the Dark Blue and Dark Grey.\r\nAll the text in the chart (except the Source and Note) use the same fonts.\r\nGrid line is missing on the chart.\r\nThese two solid-lines (not the reference lines) do not have the dots/markers.\r\n\r\nBased on the issues, we proposed some improvements to handle these issues. \r\n\r\nImprovements for the Clarity Issues and their merits\r\nAdd Y-axis, axis title and unit; -> so it can be easier to gauge the heights.\r\nRemove the stacked data (June 2009 and June 2019) from the bottom X-axis; -> so it can make the chart looks clear and neat.\r\nRemove the ‘Per Cent’ subtitle. Instead, set it as the unit of Y-axis; -> so the end-users can interpret the unit of data.\r\nRemove the two Reference line. Instead, add them as annotation; -> it is to remove misleading reference line.\r\nChange the title and subtitle to meaningful ones which reflect the context and objectives. -> so the end-users can interpret the whole chart easily.\r\nImprovements for the Aethetic Issues and their merits\r\nChange the colors of 2009-June and 2019-June to make them contrast strongly; -> so the comparison would be more obvious.\r\nChange the fonts, use different fonts for axis title, Legend, Title and Annotation etc.; -> so we can highlight the key messages.\r\nAdd the grid lines for Y-axis; -> so the end-users can interpret the chart easily.\r\n3. Sketch the design\r\nAs the report mentioned the Residents Local Force Participation Rate, we can add it into the chart as well.\r\nThe upper part of the chart is the Participation Rate of Ages in 2009-June versus in 2019-June.\r\nThe lower part of the chart is the Shares of Ages in 2009-June versus in 2019-June.\r\n\r\n4. Data Preparation\r\nSince we wanted to add the Participation Rate in the chart, we need to download the original data and put it together with the Shares of Ages in one data table.Note: LFPR stands for Labor Force Participation Rate.\r\nAges\r\nLFPR 2009-June\r\nLFPR 2019-June\r\nShares 2009-June\r\nShares 2019-June\r\n15~19\r\n11.8\r\n15.1\r\n1.6\r\n1.6\r\n20~24\r\n63.5\r\n61.0\r\n7.4\r\n6.4\r\n25~29\r\n89.3\r\n90.1\r\n11.1\r\n10.3\r\n30~34\r\n88.3\r\n92.3\r\n12.5\r\n10.9\r\n35~39\r\n85.8\r\n89.6\r\n13.5\r\n11.5\r\n40~44\r\n84.4\r\n88.7\r\n13.3\r\n11.6\r\n45~49\r\n82.1\r\n87.9\r\n13.3\r\n12.2\r\n50~54\r\n78.1\r\n82.3\r\n11.7\r\n11.0\r\n55~59\r\n68.4\r\n75.0\r\n8.0\r\n10.2\r\n60~64\r\n50.6\r\n63.9\r\n4.6\r\n7.3\r\n65~79\r\n29.9\r\n46.1\r\n1.8\r\n4.5\r\n70 & Over\r\n10.5\r\n17.6\r\n1.2\r\n2.7\r\n5. Tableau Data Visualization\r\nFinal Data Visualization in Tableau.  You can go to my Tableau Public to view High Resolution version.\r\n6. Implementation Guide in Tableau (Step by Step)\r\nLoad the excel file into Tableau\r\nDrag the Ages into Columns, Drag the LFPR 2009-June to the Rows, Drag the LFPR 2019-June on the right side of the chart. \r\nChange it to Line and choose ‘All’ Markers in the Color window. \r\nDrag the Shares 2009-June to Rows and Drag Shares 2019-June to the right side of 2nd chart. \r\nRight click any in the Measure Names pane. Edit all the Alias. Then rename them as easily understandable ones.\r\nRight click any in the Measure Names pane. Click Edit Colors. Then select the contrast colors for 2009 and 2019.\r\nChange the Share 2009-June and Share 2019-June to Area. \r\nSynchronize the Axis for both the upper part of the chart (i.e, Participation Rate) and the lower part of the chart(i.e. Shares).\r\nSelect the Axis on the left side and update the Axis titles. Remove the Right sides Axis titles.\r\nGo to X-axis. Exclude the 15~19 and 20~24 data (In terms of the Participation Rate and Shares of Labor Force, we can observe that there is no big difference between 2009-June and 2019-June for these two Age groups). Let us remove them and focus more on the labors Aged 25 and above.\r\nRight click anywhere on the chart to add a few Annotations. \r\nRight click the title to edit the title. I rename it as ‘Singapore Residents Labor Force Participation Rate and Shares by Ages’. \r\n7. Major Observations from Data Viz\r\nDuring the implementation progress, we can find out three major observations.\r\nFor the Ages 15~24, in terms of Participation Rate and Shares in Total Labor Force, there are no big differences between 2009-June and 2019-June.\r\nIn 2009-June the majority of Labor Force came from ages 25~54 whereas in 2019-June the majority came from ages 25~59. It implies that people tend to stay longer years in their career. Perhaps more and more employers like to keep the older workers in the workplace, but further investigations are required to prove it.\r\nIn general, almost all ages have higher participation rate in 2019-June than in 2009-June.\r\n\r\n\r\n\r\n",
    "preview": "posts/2021-01-24-my-1st-dataviz-makeover-in-2021/FinalChart.png",
    "last_modified": "2021-01-24T21:39:16+08:00",
    "input_file": {}
  },
  {
    "path": "posts/welcome/",
    "title": "Welcome to Tech Blog",
    "description": "Welcome to my blog, Tech Blog. I hope you enjoy \nreading it!",
    "author": [
      {
        "name": "Ling Huang",
        "url": "https://ling.party"
      }
    ],
    "date": "2021-01-24",
    "categories": [],
    "contents": "\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-01-24T14:58:16+08:00",
    "input_file": {}
  }
]
